* Card data format

See file:design/data.edn

* Spaced repetition

Memory jogging

* Use-cases

Why do we want this thing?

** @mal: Capturing thoughts and ideas that I don't want to forget

** @mal: Sharing bookmarks (deli.cio.us style)

Other colleagues might bookmark the same articles in a similar time-frame

Anyone I can discuss this link with?


** @jdt: Dumping/Sharing without interrupting

Foster gardening and curation of knowledge

** Tag cloud

** Folksonomy
https://en.wikipedia.org/wiki/Folksonomy

** @jdt: A single place where I can view the priorities - subsume all the other systems

"stop using my emacs buffer"

have a TODO list that I can very easily share (and be prioritised)

** Tasks


A Task is a Card (that might have a due-date, has a completed 'status' todo/done)

A Card can be a Reminder

** Memex

https://en.wikipedia.org/wiki/Memex


** You know you've nailed it when everybody sets it as their home page

* User Stories

** Creating a new hiring candidate

Jon receives an email from a prospective candidate with a cover note and an
attached CV. Although there doesn't seem to be an immediate vacancy to fill, the
CV looks promising and there's a pretty good chance something will come up.

Jon browses https://home.juxt.site and clicks on a link taking him to a page
displaying a new card.

He pastes the email text into the card



*** Flow

1. Open browser
2. Click [New]


** Slate Editor

*** DONE [#A] Show URLs of each paragraph (to help debug)
:LOGBOOK:
CLOCK: [2021-06-16 Wed 16:58]--[2021-06-16 Wed 17:11] =>  0:13
:END:

*** DONE Parameterize card id
:LOGBOOK:
CLOCK: [2021-06-16 Wed 17:15]--[2021-06-16 Wed 17:23] =>  0:08
:END:

*** DONE Only open up a new paragraph if text is empty
:LOGBOOK:
CLOCK: [2021-06-17 Thu 09:31]--[2021-06-17 Thu 09:50] =>  0:19
:END:

*** DONE Only save a new card when it has text

*** DONE Remove para on backspace (if empty)

*** DONE Open a new paragraph below current one

*** DONE Save new paragraphs to Site

*** DONE Get checklist working

*** TODO @ mentions

*** DONE Ability to create new containers/cards

*** TODO Ability to set attributes on individual cards
e.g. status, priority, deadline

*** TODO Ability to view all cards

*** DONE Set selection on focus to end of text

*** TODO tables!

*** TODO Image type
Allow user to turn a paragraph into an image holder

*** TODO Quote type

*** TODO bold and italic

*** TODO Use maps rather than vectors in Site model?

*** Ideas/Someday

**** Source editor

When a user does Ctrl-` the paragraph changes from <p> to <code>. That's a left-over from a Slate tutorial. But what if the code was the code 'behind' the paragraph. For example, the datalog for a table or chart?

* <2021-06-26 Sat>

** DONE Create new post

** DONE Get list of my posts through API

https://home.juxt.site/card/cards/7540e62e-1180-4472-a60e-e87117b1774a

* <2021-07-08 Thu>

** Snags
- [X] Remove ix=
- [X] Make URLs easier to click

** TODO Delete paragraphs
